### Definição de DataFrame: é um objeto bi-dimensional que contem dados em forma tabular, ou seja, é como se fosse uma tabela do Excel, que é possível adicionar linhas e colunas

In [1]:
import pandas as pd

In [2]:
# Criando DataFrame
df1 = pd.DataFrame ()

In [3]:
df1

Empty DataFrame
Columns: []
Index: []

In [4]:
type(df1)

pandas.core.frame.DataFrame

In [5]:
# importacia de dicionarias
dict1 = {'Identificacao': [1,2,3,4,5],
         'Nome':['Leandro', 'Dulcinea','Theo','Thor','Clarice']}

In [6]:
dict1

{'Identificacao': [1, 2, 3, 4, 5],
 'Nome': ['Leandro', 'Dulcinea', 'Theo', 'Thor', 'Clarice']}

In [7]:
df2 = pd.DataFrame(data= dict1)

In [8]:
df2

   Identificacao      Nome
0              1   Leandro
1              2  Dulcinea
2              3      Theo
3              4      Thor
4              5   Clarice

In [9]:
df3 = pd.DataFrame(data= dict1, index=[29,1,0,2222,88])

In [10]:
df3

      Identificacao      Nome
29                1   Leandro
1                 2  Dulcinea
0                 3      Theo
2222              4      Thor
88                5   Clarice

In [11]:
serie1 = pd.Series([1,2,3])

In [12]:
serie1

0    1
1    2
2    3
dtype: int64

In [13]:
type(serie1)

pandas.core.series.Series

In [14]:
serie2 = pd.Series(['a','b','c'])

In [15]:
serie2

0    a
1    b
2    c
dtype: object

In [16]:
df4 = pd.DataFrame({'coluna1':serie1,
                   'coluna2': serie2})

In [17]:
df4

   coluna1 coluna2
0        1       a
1        2       b
2        3       c

#### Meu treino

In [18]:
Nome_Famila = {'Nome': ['Leandro', 'Dulci','Theo'],
               'Eu souza': ['Pai','Mãe','Filho']}

In [19]:
df_famila = pd.DataFrame(data= Nome_Famila, index=['Marido', 'Esposa','Bebe'])

In [20]:
df_famila

           Nome Eu souza
Marido  Leandro      Pai
Esposa    Dulci      Mãe
Bebe       Theo    Filho

Final de treino

In [21]:
import numpy as np

In [22]:
array1 = np.array([[1,2,3],
                   ['Sao Paulo', 'Rio de Janeiro', 'Campinas'],
                   ['SP','RJ','SP']])

In [23]:
array1

array([['1', '2', '3'],
       ['Sao Paulo', 'Rio de Janeiro', 'Campinas'],
       ['SP', 'RJ', 'SP']], dtype='<U14')

In [24]:
type(array1)

numpy.ndarray

In [25]:
df5 = pd.DataFrame(data= array1.transpose(), 
                   index=['linha1','linha2','linha3'],
                   columns =['Identificação','Cidade','Estado'])

In [26]:
df5

       Identificação          Cidade Estado
linha1             1       Sao Paulo     SP
linha2             2  Rio de Janeiro     RJ
linha3             3        Campinas     SP

In [27]:
matriz1 = np.matrix([[1,2,3],
                   ['Sao Paulo', 'Rio de Janeiro', 'Campinas'],
                   ['SP','RJ','SP']])

### Selecionando DataFrame

In [28]:
df3

      Identificacao      Nome
29                1   Leandro
1                 2  Dulcinea
0                 3      Theo
2222              4      Thor
88                5   Clarice

### selecionando data frame

In [29]:
df3

      Identificacao      Nome
29                1   Leandro
1                 2  Dulcinea
0                 3      Theo
2222              4      Thor
88                5   Clarice

In [30]:
df3['identificacao_mais_5'] = df3['Identificacao'] + 5

In [31]:
df3

      Identificacao      Nome  identificacao_mais_5
29                1   Leandro                     6
1                 2  Dulcinea                     7
0                 3      Theo                     8
2222              4      Thor                     9
88                5   Clarice                    10

In [32]:
df3['index'] = 0

In [33]:
df3

      Identificacao      Nome  identificacao_mais_5  index
29                1   Leandro                     6      0
1                 2  Dulcinea                     7      0
0                 3      Theo                     8      0
2222              4      Thor                     9      0
88                5   Clarice                    10      0

In [34]:
df3.index = [29,0,1,2222,88]

In [35]:
df3

      Identificacao      Nome  identificacao_mais_5  index
29                1   Leandro                     6      0
0                 2  Dulcinea                     7      0
1                 3      Theo                     8      0
2222              4      Thor                     9      0
88                5   Clarice                    10      0

In [36]:
df3['Nome']

29       Leandro
0       Dulcinea
1           Theo
2222        Thor
88       Clarice
Name: Nome, dtype: object

In [37]:
df3['index']

29      0
0       0
1       0
2222    0
88      0
Name: index, dtype: int64

In [38]:
df3.Nome

29       Leandro
0       Dulcinea
1           Theo
2222        Thor
88       Clarice
Name: Nome, dtype: object

In [39]:
df3[['Nome', 'index']]

          Nome  index
29     Leandro      0
0     Dulcinea      0
1         Theo      0
2222      Thor      0
88     Clarice      0

In [40]:
df3[df3.Identificacao % 2 == 0]

      Identificacao      Nome  identificacao_mais_5  index
0                 2  Dulcinea                     7      0
2222              4      Thor                     9      0

In [41]:
df3[df3.Nome.str.contains('T')]

      Identificacao  Nome  identificacao_mais_5  index
1                 3  Theo                     8      0
2222              4  Thor                     9      0

In [42]:
#                                e 
df3[(df3.Nome.str.contains('T')) & (df3.Identificacao  == 3)]

   Identificacao  Nome  identificacao_mais_5  index
1              3  Theo                     8      0

In [43]:
#                               ou 
df3[(df3.Nome.str.contains('T')) | (df3.Identificacao  == 5)]

      Identificacao     Nome  identificacao_mais_5  index
1                 3     Theo                     8      0
2222              4     Thor                     9      0
88                5  Clarice                    10      0

- loc: localiza pelo NOME dos indices ou colunas

- iloc: localiza pela POSIÇÃO dos indices ou colunas

In [44]:
df3

      Identificacao      Nome  identificacao_mais_5  index
29                1   Leandro                     6      0
0                 2  Dulcinea                     7      0
1                 3      Theo                     8      0
2222              4      Thor                     9      0
88                5   Clarice                    10      0

In [45]:
df3.loc[0]

Identificacao                  2
Nome                    Dulcinea
identificacao_mais_5           7
index                          0
Name: 0, dtype: object

In [46]:
df3.iloc[0]

Identificacao                 1
Nome                    Leandro
identificacao_mais_5          6
index                         0
Name: 29, dtype: object

In [47]:
#     0 ate 1
df3.loc[0:1]

   Identificacao      Nome  identificacao_mais_5  index
0              2  Dulcinea                     7      0
1              3      Theo                     8      0

In [48]:
df3.iloc[0:1]

    Identificacao     Nome  identificacao_mais_5  index
29              1  Leandro                     6      0

In [49]:
df3.iloc[0:2]

    Identificacao      Nome  identificacao_mais_5  index
29              1   Leandro                     6      0
0               2  Dulcinea                     7      0

In [50]:
df3

      Identificacao      Nome  identificacao_mais_5  index
29                1   Leandro                     6      0
0                 2  Dulcinea                     7      0
1                 3      Theo                     8      0
2222              4      Thor                     9      0
88                5   Clarice                    10      0

In [51]:
df3.loc[88:1:-1]

      Identificacao     Nome  identificacao_mais_5  index
88                5  Clarice                    10      0
2222              4     Thor                     9      0
1                 3     Theo                     8      0

In [52]:
df3.loc[88:1:-2]

    Identificacao     Nome  identificacao_mais_5  index
88              5  Clarice                    10      0
1               3     Theo                     8      0

In [53]:
df3.loc[:,'Nome']

29       Leandro
0       Dulcinea
1           Theo
2222        Thor
88       Clarice
Name: Nome, dtype: object

In [54]:
df3.iloc[:,1]

29       Leandro
0       Dulcinea
1           Theo
2222        Thor
88       Clarice
Name: Nome, dtype: object

In [55]:
df3

      Identificacao      Nome  identificacao_mais_5  index
29                1   Leandro                     6      0
0                 2  Dulcinea                     7      0
1                 3      Theo                     8      0
2222              4      Thor                     9      0
88                5   Clarice                    10      0

In [56]:
df3.loc[2222, 'Nome']

'Thor'

In [57]:
df3.iloc[3,1] = 'Cão_Thor'

In [58]:
df3

      Identificacao      Nome  identificacao_mais_5  index
29                1   Leandro                     6      0
0                 2  Dulcinea                     7      0
1                 3      Theo                     8      0
2222              4  Cão_Thor                     9      0
88                5   Clarice                    10      0

In [59]:
df3.iloc[-1]

Identificacao                 5
Nome                    Clarice
identificacao_mais_5         10
index                         0
Name: 88, dtype: object

In [60]:
df3.iloc[-1,-2]

10

In [61]:
df3

      Identificacao      Nome  identificacao_mais_5  index
29                1   Leandro                     6      0
0                 2  Dulcinea                     7      0
1                 3      Theo                     8      0
2222              4  Cão_Thor                     9      0
88                5   Clarice                    10      0

In [62]:
df3.loc[29,['identificacao_mais_5','Nome']]

identificacao_mais_5          6
Nome                    Leandro
Name: 29, dtype: object

In [63]:
df3.loc[[0,2222]]

      Identificacao      Nome  identificacao_mais_5  index
0                 2  Dulcinea                     7      0
2222              4  Cão_Thor                     9      0

In [64]:
df3.iloc[[1,3]]

      Identificacao      Nome  identificacao_mais_5  index
0                 2  Dulcinea                     7      0
2222              4  Cão_Thor                     9      0

In [65]:


tabela = {'nome': ['Leandro','Dulci','Theo'],
          'Idade': [37,41,2]}

df_tabela = pd.DataFrame(tabela)

In [66]:
display(df_tabela)

      nome  Idade
0  Leandro     37
1    Dulci     41
2     Theo      2

In [67]:
df_tabela['famila'] = ['marido','esposa','filho']

In [68]:
df_tabela

      nome  Idade  famila
0  Leandro     37  marido
1    Dulci     41  esposa
2     Theo      2   filho

In [69]:

df_tabela.drop(columns=['Idade'])

      nome  famila
0  Leandro  marido
1    Dulci  esposa
2     Theo   filho

In [70]:
nomes_tabela = df_tabela.loc[:,'nome']

In [71]:
nomes_tabela

0    Leandro
1      Dulci
2       Theo
Name: nome, dtype: object

## Atributos de Dataframe

In [72]:
df3

      Identificacao      Nome  identificacao_mais_5  index
29                1   Leandro                     6      0
0                 2  Dulcinea                     7      0
1                 3      Theo                     8      0
2222              4  Cão_Thor                     9      0
88                5   Clarice                    10      0

In [73]:
df3.dtypes

Identificacao            int64
Nome                    object
identificacao_mais_5     int64
index                    int64
dtype: object

In [74]:
df3.Identificacao =df3.Identificacao.astype(str)

In [75]:
df3.dtypes

Identificacao           object
Nome                    object
identificacao_mais_5     int64
index                    int64
dtype: object

In [76]:
df3['teste1'] = [None, 2,4, None,10]

In [77]:
df3

     Identificacao      Nome  identificacao_mais_5  index  teste1
29               1   Leandro                     6      0     NaN
0                2  Dulcinea                     7      0     2.0
1                3      Theo                     8      0     4.0
2222             4  Cão_Thor                     9      0     NaN
88               5   Clarice                    10      0    10.0

In [78]:
df3.dtypes

Identificacao            object
Nome                     object
identificacao_mais_5      int64
index                     int64
teste1                  float64
dtype: object

In [79]:
df3.loc[:,'teste1']

29       NaN
0        2.0
1        4.0
2222     NaN
88      10.0
Name: teste1, dtype: float64

In [80]:
#     indices, columns     
df3.loc[29,'teste1'] = 3

In [81]:
df3

     Identificacao      Nome  identificacao_mais_5  index  teste1
29               1   Leandro                     6      0     3.0
0                2  Dulcinea                     7      0     2.0
1                3      Theo                     8      0     4.0
2222             4  Cão_Thor                     9      0     NaN
88               5   Clarice                    10      0    10.0

In [82]:
df3.columns

Index(['Identificacao', 'Nome', 'identificacao_mais_5', 'index', 'teste1'], dtype='object')

In [83]:
df3.columns = ['Identificacao', 'Nome', 'identificacao_mais_5', 'index_modificado', 'teste1']

In [84]:
df3

     Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
29               1   Leandro                     6                 0     3.0
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0

In [85]:
df3.index

Index([29, 0, 1, 2222, 88], dtype='int64')

In [86]:
df3.shape

(5, 5)

In [87]:
df3.values

array([['1', 'Leandro', 6, 0, 3.0],
       ['2', 'Dulcinea', 7, 0, 2.0],
       ['3', 'Theo', 8, 0, 4.0],
       ['4', 'Cão_Thor', 9, 0, nan],
       ['5', 'Clarice', 10, 0, 10.0]], dtype=object)

### Metodos I

##### combine_first

In [88]:
df3

     Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
29               1   Leandro                     6                 0     3.0
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0

In [89]:
df3.loc[29, 'teste1'] = None

In [90]:
df3

     Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
29               1   Leandro                     6                 0     NaN
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0

In [91]:
df3.teste1.combine_first(df3['identificacao_mais_5'])

29       6.0
0        2.0
1        4.0
2222     9.0
88      10.0
Name: teste1, dtype: float64

#### Copy

In [92]:
df1000 = df3.copy()

In [93]:
df1000

     Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
29               1   Leandro                     6                 0     NaN
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0

In [94]:
df1000.count()

Identificacao           5
Nome                    5
identificacao_mais_5    5
index_modificado        5
teste1                  3
dtype: int64

### drop

In [95]:
df3

     Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
29               1   Leandro                     6                 0     NaN
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0

In [96]:
df3.drop(columns=['index_modificado'])

     Identificacao      Nome  identificacao_mais_5  teste1
29               1   Leandro                     6     NaN
0                2  Dulcinea                     7     2.0
1                3      Theo                     8     4.0
2222             4  Cão_Thor                     9     NaN
88               5   Clarice                    10    10.0

In [97]:
df3

     Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
29               1   Leandro                     6                 0     NaN
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0

In [98]:
df3.drop(columns=['index_modificado'], inplace=True)

In [99]:
df3

     Identificacao      Nome  identificacao_mais_5  teste1
29               1   Leandro                     6     NaN
0                2  Dulcinea                     7     2.0
1                3      Theo                     8     4.0
2222             4  Cão_Thor                     9     NaN
88               5   Clarice                    10    10.0

In [100]:
df3.drop(index=[88], inplace=True)

In [101]:
df3

     Identificacao      Nome  identificacao_mais_5  teste1
29               1   Leandro                     6     NaN
0                2  Dulcinea                     7     2.0
1                3      Theo                     8     4.0
2222             4  Cão_Thor                     9     NaN

#### drop_duplicates

In [102]:
df7 = pd.concat([df1000,df1000])

In [103]:
df7

     Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
29               1   Leandro                     6                 0     NaN
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0
29               1   Leandro                     6                 0     NaN
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0

In [104]:
df7.drop_duplicates(inplace=True)

In [105]:
df7

     Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
29               1   Leandro                     6                 0     NaN
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0

#### dropna

In [106]:
df8 = df7.copy()

In [107]:
df8

     Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
29               1   Leandro                     6                 0     NaN
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0

In [108]:
df8.dropna(inplace=True)

In [109]:
df8

   Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
0              2  Dulcinea                     7                 0     2.0
1              3      Theo                     8                 0     4.0
88             5   Clarice                    10                 0    10.0

#### fillna

In [110]:
df7

     Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
29               1   Leandro                     6                 0     NaN
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0

In [111]:
df7.fillna('NULO', inplace=True)

C:\Users\Leandro\AppData\Local\Temp\ipykernel_12612\928111277.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'NULO' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df7.fillna('NULO', inplace=True)

In [112]:
df7

     Identificacao      Nome  identificacao_mais_5  index_modificado teste1
29               1   Leandro                     6                 0   NULO
0                2  Dulcinea                     7                 0    2.0
1                3      Theo                     8                 0    4.0
2222             4  Cão_Thor                     9                 0   NULO
88               5   Clarice                    10                 0   10.0

#### head

In [113]:
df7.head(2)

   Identificacao      Nome  identificacao_mais_5  index_modificado teste1
29             1   Leandro                     6                 0   NULO
0              2  Dulcinea                     7                 0    2.0

#### tail

In [114]:
df7.tail(2)

     Identificacao      Nome  identificacao_mais_5  index_modificado teste1
2222             4  Cão_Thor                     9                 0   NULO
88               5   Clarice                    10                 0   10.0

#### gropby

In [115]:
df10 = pd.concat([df1000,df1000])

In [116]:
df10

     Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
29               1   Leandro                     6                 0     NaN
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0
29               1   Leandro                     6                 0     NaN
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0

In [117]:
df10.groupby(['Nome']).identificacao_mais_5.sum()

Nome
Clarice     20
Cão_Thor    18
Dulcinea    14
Leandro     12
Theo        16
Name: identificacao_mais_5, dtype: int64

### Modulos II